index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-04-07 Fri 10:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Piotr Limanowski</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Piotr" />
<link rel="shortcut icon" href="https://codearsonist.com/favicon.ico" />
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/paper-css/0.3.0/paper.css">
<link rel="stylesheet" type="text/css" href="https://fonts.googleapis.com/css?family=Roboto+Slab:700,300,400,200|Roboto:700,300,400,200" />
<link rel="stylesheet" type="text/css" href="./static/resume.css" />
</head>
<body>
<div id="content">
<div class="A4"><section class="sheet">

<div id="outline-container-org6b34a55" class="outline-2 header">
<h2 id="org6b34a55">Piotr Limanowski</h2>
<div class="outline-text-2" id="text-org6b34a55">
</div>
</div>
<div id="outline-container-orgab956ba" class="outline-2 contact">
<h2 id="orgab956ba"><span class="done DONE">DONE</span> Contact</h2>
<div class="outline-text-2" id="text-orgab956ba">
<dl class="org-dl">
<dt>email</dt><dd><a href="mailto:piotr@codearsonist.com">piotr@codearsonist.com</a></dd>
<dt>web</dt><dd><a href="https://codearsonist.com">codearsonist.com</a></dd>
</dl>
</div>
</div>
<div id="outline-container-orgb6ca9e7" class="outline-2 experience">
<h2 id="orgb6ca9e7">Experience</h2>
<div class="outline-text-2" id="text-orgb6ca9e7">
</div>
<div id="outline-container-org40378d8" class="outline-3">
<h3 id="org40378d8"><span class="todo TODO">TODO</span> Technical Architect - Schibsted Tech Polska</h3>
<div class="outline-text-3" id="text-org40378d8">
</div><div id="outline-container-orgdff15d5" class="outline-4">
<h4 id="orgdff15d5">Jan 2015 - to date</h4>
<div class="outline-text-4" id="text-orgdff15d5">
<p>
As a Software Architect and Fullstack Dev with Java, Scala and most recently Elixir as a part of a small team I was tasked to migrate a legacy application to a modern cloud-backed multi-module micro service-based application. 
We migrated the old monolith to Docker and CoreOS solution based upon AWS. Currently we continue to deliver new services using Scala, Java and Elixir.
</p>
</div>
</div>
</div>

<div id="outline-container-orgc2368bb" class="outline-3">
<h3 id="orgc2368bb"><span class="todo TODO">TODO</span> Technical Architect - Middleware Services - Nordea</h3>
<div class="outline-text-3" id="text-orgc2368bb">
</div><div id="outline-container-org13767ae" class="outline-4">
<h4 id="org13767ae">Jan 2012 - Dec 2014</h4>
<div class="outline-text-4" id="text-org13767ae">
<p>
As a Principal Developer and Technical Architect I have been responsible for delivering of the Service Oriented Middleware services for the company. The approach assumed fast service delivery, scalability, simple integration and changeability.
</p>
</div>
</div>
</div>

<div id="outline-container-org90130ec" class="outline-3">
<h3 id="org90130ec"><span class="todo TODO">TODO</span> Java Developer - Financial Analysis &amp; Reporting - Nordea</h3>
<div class="outline-text-3" id="text-org90130ec">
</div><div id="outline-container-orgc32c6bf" class="outline-4">
<h4 id="orgc32c6bf">April 2011 - Dec 2011</h4>
<div class="outline-text-4" id="text-orgc32c6bf">
<p>
The aim of the project was to deliver an application for rating calculation, analysis and reporting of corporate customers’.
</p>
</div>
</div>
</div>

<div id="outline-container-org7b1fe14" class="outline-3">
<h3 id="org7b1fe14"><span class="todo TODO">TODO</span> Java Developer - File Delivery Automation - Nordea</h3>
<div class="outline-text-3" id="text-org7b1fe14">
</div><div id="outline-container-org9093966" class="outline-4">
<h4 id="org9093966">April 2011 - Dec 2011</h4>
<div class="outline-text-4" id="text-org9093966">
<p>
The aim of the project was to deliver a common, automated, scalable and managed solution for inter and intra-company  le deliveries.
</p>
</div>
</div>
</div>

<div id="outline-container-orgb4c2ac1" class="outline-3">
<h3 id="orgb4c2ac1"><span class="todo TODO">TODO</span> Java Developer - KAOS Consulting</h3>
<div class="outline-text-3" id="text-orgb4c2ac1">
</div><div id="outline-container-orgbc9309c" class="outline-4">
<h4 id="orgbc9309c">Oct 2010 - April 2011</h4>
<div class="outline-text-4" id="text-orgbc9309c">
<p>
I was picked as a developer for the project from an International Exchange Bureau draft. The aim of the project was to deliver an automated data analysis and trend recognition tool along with cross-system integration.
</p>
</div>
</div>
</div>

<div id="outline-container-orgac680ab" class="outline-3">
<h3 id="orgac680ab"><span class="todo TODO">TODO</span> Web Developer, m.photoblog.pl - PixNet</h3>
<div class="outline-text-3" id="text-orgac680ab">
</div><div id="outline-container-org4a7a3d9" class="outline-4">
<h4 id="org4a7a3d9">Oct 2010 - Jan 2009</h4>
<div class="outline-text-4" id="text-org4a7a3d9">
<p>
The aim of the project was to build a mobile application for the biggest polish photoblogging platform.
</p>
</div>
</div>
</div>

<div id="outline-container-org0724187" class="outline-3">
<h3 id="org0724187"><span class="todo TODO">TODO</span> Web Developer, PhotoSplash - PixNet</h3>
<div class="outline-text-3" id="text-org0724187">
</div><div id="outline-container-org6dd71ec" class="outline-4">
<h4 id="org6dd71ec">Oct 2010 - Jan 2009</h4>
<div class="outline-text-4" id="text-org6dd71ec">
<p>
The aim of the project was to build a web application allowing a user to input a photo and pick photo manipulation effect to be applied. 
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org0018a88" class="outline-2 education">
<h2 id="org0018a88">Education</h2>
<div class="outline-text-2" id="text-org0018a88">
</div>
<div id="outline-container-orge324d51" class="outline-3">
<h3 id="orge324d51"><span class="done DONE">DONE</span> Gdansk University of Technology</h3>
<div class="outline-text-3" id="text-orge324d51">
</div>
<div id="outline-container-org3a2747f" class="outline-4">
<h4 id="org3a2747f">Electronics, Telecommunications and Informatics Faculty</h4>
<div class="outline-text-4" id="text-org3a2747f">
<p>
MA thesis: <i>"Face Recognition in the crowd using high resolution camera image"</i>. Developed in Java with JNI for compatibility with supercomputer. 
</p>

<p>
<b>Grade:</b> Distinction
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgeda53a5" class="outline-2 skills">
<h2 id="orgeda53a5">Skills</h2>
<div class="outline-text-2" id="text-orgeda53a5">
</div>
<div id="outline-container-orga4e6262" class="outline-3">
<h3 id="orga4e6262"><span class="done DONE">DONE</span> Programming</h3>
<div class="outline-text-3" id="text-orga4e6262">
</div>
<div id="outline-container-org00fe851" class="outline-4 percent-80">
<h4 id="org00fe851">Scala</h4>
<div class="outline-text-4" id="text-org00fe851">
</div>
</div>
<div id="outline-container-org0daa3f6" class="outline-4 percent-40">
<h4 id="org0daa3f6">Elixir</h4>
<div class="outline-text-4" id="text-org0daa3f6">
</div>
</div>
<div id="outline-container-org29f9b2e" class="outline-4 percent-80">
<h4 id="org29f9b2e">JS</h4>
<div class="outline-text-4" id="text-org29f9b2e">
</div>
</div>
<div id="outline-container-org5727ff1" class="outline-4 percent-80">
<h4 id="org5727ff1">Java</h4>
<div class="outline-text-4" id="text-org5727ff1">
</div>
</div>
<div id="outline-container-org098435a" class="outline-4 percent-40">
<h4 id="org098435a">Ruby</h4>
<div class="outline-text-4" id="text-org098435a">
</div>
</div>
<div id="outline-container-org618127d" class="outline-4 percent-80">
<h4 id="org618127d">Bash</h4>
<div class="outline-text-4" id="text-org618127d">
</div>
</div>
</div>
<div id="outline-container-orga43ec17" class="outline-3">
<h3 id="orga43ec17"><span class="todo TODO">TODO</span> Tooling</h3>
<div class="outline-text-3" id="text-orga43ec17">
</div><div id="outline-container-org886ba8c" class="outline-4">
<h4 id="org886ba8c">Git</h4>
</div>
<div id="outline-container-org8e61bc0" class="outline-4">
<h4 id="org8e61bc0">Docker</h4>
</div>
<div id="outline-container-orgcf24db2" class="outline-4">
<h4 id="orgcf24db2">Amazon WS</h4>
</div>
<div id="outline-container-org5eda780" class="outline-4">
<h4 id="org5eda780">Continuous Delivery</h4>
</div>
<div id="outline-container-orga42fea7" class="outline-4">
<h4 id="orga42fea7">TDD/BDD</h4>
</div>
</div>
<div id="outline-container-orgbece424" class="outline-3">
<h3 id="orgbece424"><span class="done DONE">DONE</span> Professional</h3>
<div class="outline-text-3" id="text-orgbece424">
</div>
<div id="outline-container-orga7f2908" class="outline-4">
<h4 id="orga7f2908">Communication</h4>
</div>
<div id="outline-container-org4920864" class="outline-4">
<h4 id="org4920864">Problem Solving</h4>
</div>
<div id="outline-container-orga8b90c3" class="outline-4">
<h4 id="orga8b90c3">Technical Leadership</h4>
</div>
<div id="outline-container-org9aa2712" class="outline-4">
<h4 id="org9aa2712">Goal Orientation</h4>
</div>
<div id="outline-container-orgc895918" class="outline-4">
<h4 id="orgc895918">Commitment</h4>
</div>
</div>
</div>
<div id="outline-container-org61f7d56" class="outline-2 languages">
<h2 id="org61f7d56"><span class="done DONE">DONE</span> Languages</h2>
<div class="outline-text-2" id="text-org61f7d56">
</div>
<div id="outline-container-org7e2e912" class="outline-4 percent-100">
<h4 id="org7e2e912">English</h4>
<div class="outline-text-4" id="text-org7e2e912">
</div>
</div>
<div id="outline-container-org1a4efcf" class="outline-4 percent-40">
<h4 id="org1a4efcf">German</h4>
<div class="outline-text-4" id="text-org1a4efcf">
</div>
</div>
<div id="outline-container-org6652ee2" class="outline-4 percent-20">
<h4 id="org6652ee2">Japanese</h4>
<div class="outline-text-4" id="text-org6652ee2">
</div>
</div>
</div>

<div id="outline-container-org3b4eff5" class="outline-2 footer">
<h2 id="org3b4eff5"><span class="done DONE">DONE</span> Footer</h2>
<div class="outline-text-2" id="text-org3b4eff5">
<br style="clear: left;" ></section></div>
</div>
</div>
</div>
</body>
</html>
